Revit 2027 API
ParameterTypeId.AnalyticalModelColumnTopExtension Property
 "Top x Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelColumnTopExtension { get; }
Public Shared ReadOnly Property AnalyticalModelColumnTopExtension As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelColumnTopExtension {
	ForgeTypeId^ get ();
}
static member AnalyticalModelColumnTopExtension : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace